[
    {
        "id": "6",
        "did": "21-10-06",
        "date": "October 6, 2021",
        "author": "by Thomas Maestas, MA",
        "cat3": "Musing Blockchain",
        "title": "Blockchain Miracles, Part II: CDs<br />Hex's utility as the First Blockchain CD and Building Innate Resistance to Price Drops",
        "post": "\n  <p class=\"firstparagraph\">Hex<sup>0</sup> white papers<sup>3</sup> reveal a seemingly ordinary DeFi Ethereum smart contract, \n  which by design is the first Certificate of Deposit. An interesting side-effect incentivizes hodling the Hex token, \n  rather than trading it or selling it. This behavior is by definition the single most effective factor on dictating a token's Market Cap value: More buyers (and hodlers) than sellers ...</p>\n  <p>Therefore, Hex, ranked #3 in Market Cap<sup>1</sup>, is the only crypto that can drive up in value, but cannot lower in price ... <i>because there will never be enough sellers to outmatch the Hex hodlers (usually staking) and Hex buyers!</i>\n  \n<p class=\"quote\"> </p>\n",
        "blogcite": "\n<h6>Pre-2019 immutable record of Hex Citations, White Papers, Security & Financial Audits</h6>\n<p class=\"footnotes\">0. <a href=\"https://hex.com\"   target=\"_blank\">https://hex.com</a>\n<br />1. <a href=\"https://nomics.com\"   target=\"_blank\">https://nomics.com</a>\n<br />2. <a href=\"hex.com/techspecs\"   target=\"_blank\">hex.com/techspecs</a>\n<br />3. <a href=\"https://docs.google.com/document/d/1P0ZDaBQx4ghkdX5IUwZb1n8ThvYf7i22MSt9Gm00JRU/edit\"   target=\"_blank\">Hex Smart Contract</a>\n<br />4. <a href=\"https://hex.com/docs/HEX-Security-Audit-by-CoinFabrik-DEC2019.pdf\"   target=\"_blank\">Coinfabric security audit</a>\n<br />5. <a href=\"https://hex.com/docs/HEX%20Economics%20Audit%20by%20CoinFabrik.pdf\"   target=\"_blank\">Coinfabric financial audit</a></p>\n\n\n \n \n</p>   "
    },
    {
        "id": "5",
        "did": "21-10-05",
        "date": "October 5, 2021",
        "author": "by Thomas Maestas, MA",
        "cat3": "Musing Blockchain",
        "title": "Blockchain Miracles, Part I: Oracles<br />Chainlink's Real Time Data and the secret to Ethereum's DeFi Network (Decentralized Finance) ",
        "post": "\n  <p class=\"firstparagraph\">Since October 1st I have felt very bullish on both Bitcoin and Ethereum. As it happens, their respective price values have rose from 48k to 55k, & Ethereum's 3k to 3.5k. \n  September is always a bad month for crypto. </p><p>More importantly, what drives the utility of the Ethereum Token is its irreducible requirement to run, operate, and transact any smart contracts on the Ethereum Virtual Machine, i.e., distributed, global Operating System.\n  </p>\n \n    \n<p class=\"quote\">Oracles from Chainlink, a provider of data feeds to smart contracts, have been integrated into Ethereum scaling solution Arbitrum One.</i><sup>1</sup> </p>\n  <ul class=\"quote\"><li class=\"quote\">\n  Chainlink's U.S. dollar-denominated price feeds are available now, with support for new price pairs to follow, according to an announcement shared with CoinDesk Thursday.\n  </li><li>Arbitrum says it is addressing a common request from smart-contract developers, who require high-quality data from financial markets to power decentralized exchanges, futures and options platforms and algorithmic stablecoins.\n  </li><li>The Chainlink feeds provide Arbitrum with high-frequency price updates allowing assets to be valued on-chain and in real time.\n  </li><li class=\"quote\">Arbitrum says developers will be able to receive the same data quality and reliability as on the Ethereum base layer, but at lower cost and with more frequent updates.</li>\n  </ul>\n",
        "blogcite": "\n<p class=\"footnotes\">1. <a href=\"https://www.coindesk.com/markets/2021/08/12/chainlink-oracles-become-available-on-ethereum-scaler-arbitrum-one/\"   target=\"_blank\">https://www.coindesk.com/markets/2021/08/12/chainlink-oracles-become-available-on-ethereum-scaler-arbitrum-one/</a>\n<br /><a href=\"https://chain.link/\"   target=\"_blank\">https://chain.link/</a>\n \n</p> \n  "
    },
    {
        "id": "4",
        "did": "21-10-04",
        "date": "October 4, 2021",
        "author": "by Thomas Maestas, MA",
        "cat3": "Musing Blockchain",
        "title": "Ethereum's Institutional DAPP Coronation",
        "post": " \n  <p class=\"firstparagraph\">Financial Institutions' acceptance and adoption (i.e., BofA,Visa,PayPal,GrayScale,...) resembles the retail's interest and adoption resulting in the 2017 run-up. More importantly, interest in actual utility (smart contraacts and distributed ledger's utility in mediating real estate, titles, trusts, etc.) and applicability differentiates the current era.  </p>\n\n  <p class=\"quote\"><i>“In the near future, you may use blockchain technology to unlock your phone; buy a stock, house or fraction of a Ferrari; receive a dividend; borrow, loan or save money; or even pay for gas or pizza,” the report states.\n\n  Along the way, Bank of America cites sizable figures—such as more than $17 billion worth of venture capital investments in digital assets and blockchain firms in the first half of 2021 alone, compared to $5.5 billion across all of 2020.\n   </i><sup>1</sup> </p>\n   <p>The article further outlines assets that outstrip the mere market value of the tokens themselves: After all, doesn't the value of a socio-economic disruption underlie the mere, simplistic value of the token's market cap? \n   Distributed <i>(decentralized)</i> Applications (DAPPs) represent a new means of accomplishing a formerly centralized task: i.e. government ID's, titles, etc.) </p>\n   <p class=\"quote\"><i> ... the report states that the “digital asset sector [is] too large to ignore,” and that there’s more to watch beyond Bitcoin. “We believe crypto-based digital assets could form an entirely new asset class,” the report reads. \n   “Bitcoin is important with a market value of ~$900 billion, but the digital asset ecosystem is so much more.” </i><sup>1</sup> </p>\n<p>So now, we need to alter our favorite cliche, \"There's a DAPP for that!</p>\"\n    ",
        "blogcite": "\n  <p class=\"footnotes\">1. <a href=\"https://decrypt.co/82573/bank-of-america-bullish-bitcoin-ethereum-defi-nfts\"   target=\"_blank\"> https://decrypt.co/82573/bank-of-america-bullish-bitcoin-ethereum-defi-nfts</a>\n  </p>   "
    },
    {
        "id": "3",
        "did": "21-10-01",
        "date": "October 1, 2021",
        "author": "by Thomas Maestas, MA",
        "cat3": "Musing Blockchain",
        "title": "Ethereum's Next Leap Year",
        "post": " \n<p class=\"firstparagraph\">This year does feel reminiscingly like 4th quarter 2017 when Ethereum price jumped from 300's to 1400. Whatever the direction and timing Ethereum's price point in the 4th quarter, the utility of Ethereum's \"gas\" is the true value: Ethereum gas exclusively runs all Ethereum-based tokens (ERC-20) circulating as smart contracts on the Ethereum Virtual Machine. \nAfter all, any of the tokens on Ethereum network will always require Ether to transact, swap, send or any other smart contract function. This article covers the finer points of Ethereum's current value.<br />\n<br />Technical Indicators<br />\n1. Stochastic RSI - compares its closing price with the price range over a given period. (a reading above 80 is considered excessively bought and below 20 is considered excessively sold)<br />\n2. Relative Strength Index (RSI) - measures the magnitude of recent price changes to evaluate overbought or oversold conditions in the price of a stock or other asset. The RSI is displayed as an oscillator (a line graph that moves between two extremes) and can have a reading from 0 to 100.<br />\n3. Bullish Hammer - candle that indicates the likely bottom of a trend. It is characterized by a long wick at the bottom with a short body on top. That shows that bears pushed the price down during the time frame, only to see significant buying pressure step in to close higher than the candle open. <br />\n4. Fibonacci retracement level - Method for determining support and resistance levels. It is named after the Fibonacci sequence of numbers, whose ratios provide price levels to which markets tend to retrace a portion of a move, before a trend continues in the original direction.\n<br />\n</p>\n \n",
        "blogcite": "\n<p class=\"footnotes\"> <a href=\"https://cointelegraph.com/news/ethereum-fractal-from-2017-that-resulted-in-7-000-gains-for-eth-appears-again-in-2021\"   target=\"_blank\">https://cointelegraph.com/news/ethereum-fractal-from-2017-that-resulted-in-7-000-gains-for-eth-appears-again-in-2021 </a>\n</p>   "
    },
    {
        "id": "2",
        "did": "21-05-18",
        "date": "May 18, 2021",
        "author": "by Thomas Maestas, MA",
        "cat3": "Musing Blockchain",
        "title": "ETH v. BTC v. ADA, Part I: Ethereum's Law of Large Numbers",
        "post": " \n<p class=\"firstparagraph\">Ethereum's world virtual machine has proven utility already, and only the tip of the iceberg has been reached for potential. DeFi applications have locked 2/3 Ethereum, which boosts from $600 to $4000, summing to market cap of $388,000,000. <img src=\"dist/img/ada-btc-eth.png\" class=\"zoom\"   /> <p><i><small>Matic vs Ada vs ETH vs BTC performance (source: TradingView)</small></i></p> <p>The interesting matter is Ethereum's DeFi applicibility--from real estate to pools and loans--based on sophisticated smart contracts. Bitcoin, aside from form of value, has no parallel attraction...\n",
        "blogcite": "\n<p class=\"footnotes\">1. <a href=\"https://www.benzinga.com/node/21184597\"   target=\"_blank\">Is the Bitcoin-Ethereum 'Flippening' a Likely Scenario?</a>\n</p>   "
    },
    {
        "id": "1",
        "did": "21-05-17",
        "date": "May 17, 2021",
        "author": "by Thomas Maestas, MA",
        "cat3": "Web Dev Affairs",
        "title": "ETH v. BTC v. ADA, Part I: Varying levels of DAPP Community-Building ",
        "post": " \n<p>Doubtless, New Chain Lifecycle is 5% utility, 5% hype and 90% Decentralized App developers' community -- the ingredient <i>par excellence</i> for lasting hype and adoption. Here we have the exponential growth of Ethereum interest, let alone price of token. On the contrary we have Cardano Network, powered by Proof-of-Stake ADA token, which has yet to evolve past TestNet phase, a point of paralysis for Cardano chain DAPP development. One last step before final main net launch, and finally, we can witness David face Goliath...</p>\n\n<p class=\"quote\"><i>This year, we are seeing the direct competitors clashing. Ethereum has made great strides to make it scalable and affordable, with the Berlin fork already finalized and London hard fork scheduled for July.\nIn the meantime, Cardano smart contracts should be entering the Cardano testnet by the end of this month.</i><sup>1</sup> \n</p>\n<p>Better late than never, the Cardano blockchain ecosystem boasts superior, more efficient, sophisticated smart contracting:</p>\n<p class=\"quote\">Cardano (ADA) is a highly anticipated direct competitor to Ethereum, promising more scalability and smart contracts with the Alonzo upgrade.</p>\n<p>There are two obstinate problems:<i>Ethereum's monopolistic and universal DAPP evolution and ADA's stunted community development.</i></p>\n<p>First, All customized business applications, whether off-chain or on-, have built architectures depending on private/consortium blockchains that periodically sync with Ethereum mainnet. </p><p>Secondly, whether or not Cardono does launch main net, the multi-year delay in even <i>launching</i>chain mainnet --for all its bells and whistles -- has stunted new development and developer solidarity. Despite the author's praise for ADA, he concedes the infinitesimally small likelihood that Cardano developers will ever approach Ethereum network --</p> \n<p class=\"quote\">Lastly, despite getting up to 7th rank, Cardano (ADA) is not likely to catch up with Ethereum’s much larger dev pool and network effect.<sup>1</sup></p>\n<p>And so, beyond Ethereum 2's Proof-of-Stake transition on the near horizon, ethereum enjoys a burgeoning ecosystem of layer-2 sidechains, facilitated by the likes of those as Polygon (Matic) solutions. Even so, next to Polkadot ecosystem, only Cardano stands as a viable challenge, how ever miniscule it may be...</p>\n<p class=\"quote\">\n*Ethereum holds (by far) the largest pool of developers, according to Electric Capital. As a number of open source dev ops tools are available to make remote work easier through collaboration, managing developers remains a serious cog in DeFi development. Yet Ethereum and its developer community have thus far been dominant in this sense.<br /><br />\n*In the last three years, Ethereum has widened its developer pool by 215%. Such a network effect would be exceedingly difficult to overcome.</i><sup>2</sup> \n</p></p>\n",
        "blogcite": "\n \n<p class=\"footnotes\">1. <a href=\"https://finance.yahoo.com/news/cardano-prepares-launch-alonzo-testnet-130000976.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAKH0bKJvZsFbQBykBexupKV-HvvhwSDQjmlBmyM4Q69AaNPYvc4Tk8LSJIyBqekdp0PAPL7kz0hTgJFEwOB3jchU4gzkApL6bQay9JZ2z16ddSW5RsCYEp049RRj-L_zFhrhze_83BrLCQjxz_-oOvLEbc8l3X_T4KdO8-eQf6cz\"   target=\"_blank\">cardano-prepares-launch-alonzo-testnet</a>\n</p>   \n<p class=\"footnotes\">2. <a href=\"https://www.benzinga.com/node/21184597\"   target=\"_blank\">Is the Bitcoin-Ethereum 'Flippening' a Likely Scenario?</a>\n</p>\n"
    }
]